{
	"profile": {
		"introduction_to": {
			"text": "France, a founding EU member, combines rich history with strong public infrastructure. Life here blends a slower pace in rural regions with vibrant cultural life in cities like Paris, Lyon, and Marseille. Healthcare, transport, and education are well-developed, but bureaucracy can be frustrating. ",
			"source": "https://en.wikipedia.org/wiki/France"
		},
		"where_to_live": {
			"text": "France offers diverse living environments—from cities like Paris and Lyon to rural areas like Dordogne. Urban areas offer services and jobs, while rural France provides lower costs and slower pace. ",
			"source": "https://www.expatica.com/fr/moving/location/where-to-live-in-france-103861/"
		},
		"utilities": {
			"text": "Utilities are reliable and typically billed monthly. Electricity (EDF), gas (Engie), and water are widely available. Broadband is fast in most urban areas. ",
			"source": "https://www.completefrance.com/living-in-france/buying-guide-part-12-utilities-and-banking-8349056/"
		},
		"pets": {
			"text": "France is a pet-friendly country. Dogs and cats are common in cities and countryside alike. Pet passports, microchipping, and up-to-date rabies vaccination are required for entry. Some breeds are restricted. ",
			"source": "https://www.diplomatie.gouv.fr/en/coming-to-france/entering-france/article/travelling-with-pets"
		},
		"banking": {
			"text": "France’s banking system is modern and accessible. Expats can open an account with ID and proof of address. BNP Paribas, Crédit Agricole and Société Générale are major banks. ",
			"source": "https://www.expatica.com/fr/finance/banking/banking-in-france-1089107/"
		},
		"education": {
			"text": "School is free and compulsory from age 3 to 16. Public schools follow a national curriculum; private and bilingual options exist. ",
			"source": "https://www.expatica.com/fr/education/children-education/a-guide-to-the-french-education-system-101123/"
		},
		"childcare": {
			"text": "France offers subsidised childcare through crèches (day nurseries), assistantes maternelles (certified childminders), and school-based services. Wraparound care often includes lunch and after-school activities. ",
			"source": "https://www.expatica.com/fr/living/family/french-childcare-options-103827/"
		},
		"crime": {
			"text": "Petty theft and pickpocketing are common in tourist areas. Violent crime rates are low. France has both the Police Nationale and Gendarmerie. Gun laws are strict and require licensing. ",
			"source": "https://www.gov.uk/foreign-travel-advice/france/safety-and-security"
		},
		"healthcare": {
			"text": "Universal healthcare is accessed with the Carte Vitale. Most costs are reimbursed; many also buy private 'mutuelle' insurance. ",
			"source": "https://www.ameli.fr/assure/english-pages"
		},
		"politics": {
			"text": "France is a semi-presidential republic. The President shares power with the Prime Minister and a bicameral Parliament. Political debate is active and diverse. ",
			"source": "https://www.cia.gov/the-world-factbook/countries/france/"
		},
		"lgbtqia": {
			"text": "Same-sex marriage and adoption have been legal since 2013. Legal protections exist for gender identity. PACS offers an alternative to marriage. ",
			"source": "https://www.equaldex.com/region/france"
		},
		"poc": {
			"text": "Racial discrimination is illegal but still reported, especially among Black, North African, and Muslim communities. ",
			"source": "https://fra.europa.eu/en/country-data/2023/country-report-france-2023"
		},
		"immigrants_and_asylum_seekers": {
			"text": "France accepts asylum claims and offers integration services, but delays and public hostility have increased. ",
			"source": "https://www.unhcr.org/fr/"
		},
		"religion": {
			"text": "France is officially secular (laïcité). All religions are protected but religious symbols are restricted in public institutions. ",
			"source": "https://www.cie.fr/"
		},
		"cultural_life": {
			"text": "France has a rich cultural calendar, from Bastille Day to Cannes Film Festival. Museums, cuisine, and fashion are central. ",
			"source": "https://www.france.fr/en"
		},
		"job_market_and_employment": {
			"text": "Demand is high in healthcare, IT, and engineering. French language skills are typically essential. ",
			"source": "https://www.service-public.fr/particuliers/vosdroits/N19806"
		},
		"pathways_to_citizenship": {
			"text": "Naturalisation requires 5 years of residency (2 with a French degree), integration, and language skills. ",
			"source": "https://www.service-public.fr/particuliers/vosdroits/F2213"
		},
		"digital_infrastructure": {
			"text": "High-speed internet is widely available, especially in cities. 5G and fibre coverage expanding rapidly. ",
			"source": "https://www.arcep.fr/"
		},
		"my_experience": {
			"text": "Expats report high quality of life and excellent healthcare, but adjusting to French bureaucracy and formal culture can be a challenge. Speaking French helps enormously. ",
			"source": "https://www.expatica.com/fr/moving/about/france-for-expats-100736/"
		},
		"important_resources": {
			"text": "France Visas (",
			"source": "https://france-visas.gouv.fr), Service Public (https://www.service-public.fr), OFII (immigration office), and Ameli (https://www.ameli.fr) are essential resources for health, legal residence, and integration support."
		}
	},
	"data": {
		"median_income": 2183,
		"cost_of_living": 64.4,
		"quality_of_life": 169.5,
		"racial_equality": 20,
		"lgbtq_safety": 74,
		"life_expectancy": 82.5,
		"average_cost": {
			"utilities": 182.5,
			"rental_capital": 1469,
			"rental_other": 1061
		},
		"climate_zone": "temperate",
		"average_temp": { "f": 55, "c": 12.9 },
		"world_happiness_index": 33,
		"net_migration": 90527,
		"healthcare_system_type": "universal",
		"visa_free_access_possible": true
	}
}
